Revit 2026 API

# ViewPrint(View) Method

---

Print this view with the given view template and using the print setting of the current active document.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void Print(
	View viewTemplate
)
```
```vb
Public Sub Print (
	viewTemplate As View
)
```
```cpp
public:
void Print(
	View^ viewTemplate
)
```
```fsharp
member Print :
        viewTemplate : View -> unit
```

#### Parameters

viewTemplate View
    The view template which apply to the view.

| Exception | Condition |
| --- | --- |
| InvalidOperationException | Thrown when the view cannot be printed. |

#### Reference

View Class

Print Overload

Autodesk.Revit.DB Namespace